const text = `А
а
а как же
а то как же
а то нет
а толку что
а толку-то
а чего ж
а что
а что ж
а-а
а-а-а
а-а-а-а
ааа
абзац
агу
агуленьки
агулечки
агунюшки
агушеньки
адью
ае
ай
ай-ай-ай
ай-люли
ай-я-яй
ай-яй-яй
айда
айда-те
айдате
аксиос
алаверды
алё
алле
алле-гоп
аллилуйя
алло
ам
ам-ам
амба
аминь
анкор
ап
апорт
ариведерчи
асеньки
асса
ась
атанда
атанде
атас
ату
ать
ау
ауф
ауфидерзейн
ах
ах вон что
ах вот как
ах вот что
ах так
ах ты
ах-ах
ах-ах-ах
ах-х-х
ахти
ахти-хти
ахтунг
Б
ба
ба, ба, ба
баиньки
баиньки-баю
бай-бай
банзай
баста
батюшки
батюшки-светы
бац
баю
баю-бай
баю-баю
баю-баю-баю
баю-баюшки-баю
баюшки-баю
бе
безобразие
бинго
бис
бла-бла-бла
благодыр
блин
бля
бляха-муха
бо-бо
боже
божечки
бр
брависсимо
браво
брейк
брысь
бугага
будет
буц
бяша
В
в рот ебаться
в рот тебе елду
вау
вах
виват
вира
во
вольно
вон
всё
всего
вуаля
Г
га
гав
гайда
ге
гей
геть
гип-гип
гип-гип-ура
гля
глядь
гм
гмм
го
гой
гоп
гоп-ля
гопля
горько
господи
готовьсь
гугу
гули
гулиньки
гуль
Д
да-а
да-да
да-да-да
долой
дон
досвидос
достаточно
дратути
дудочки
дык
Е
ё
ё-моё
ёб
ёб вашу мать
ёб иху мать
ёб твою мать
ебануться
ёбаный в жопу
ёбаный в рот
ёбаный покос
ёбаный стос
ебать
ебать мой лысый череп
ебёна мать
еби его мать
еби её мать
ебись твою в ноздрю
ебит твою мать
ёбс
ёбс-переёбс
ебут вашу мать
ёбушки-воробушки
едрёна мать
едри твою рыбу!
ей-богу
ей-Богу
ей-ей
ёклмн
ёксель-моксель
ёлки зелёные
ёлки-моталки
ёлки-палки
ёлы-палы
ёпрст
ёпт
ёпть
ессно
естественно
есть
ети
ети его
ети его мать
ети её мать
ети их
ети их в глотку мать
ети их мать
ети иху мать
ети твою мать
ети тебя в душу
ети-разъети
етит твою ети
ёшкин кот
Ж
жесть
З
здорово
здравствуй
здравствуйте
здрасте
здрасьте
здрахуйте
И
и
и-го-го
ибиомать
извините
иншала
иншалла
иншаллах
исполать
их
Й
йоу
К
как бы не так
кап
карамба
кек
кис-кис
ко-ко-ко
копать мой лысый череп
кругом
крутяк
кусь
кхм
кш
кыс
кыш
Л
ловко
ля-ля-ля
М
м
м-да
м-м
м-м-м
майна
мама миа
маран-афа
марш
матушки
мать его ети
мать её ети
мать её перемать
мать её так
мать ети
мать их ёб
мать их ети
мать иху ёб
мать моя женщина
мать твою ёб
мать твою ети
мать твою распроеби
мах
ме
мерси
мля
мм
могила
мотор
мяу
Н
н-да
нате
не-ет
ни-ни
но
но-но
ну
ну-ка
ну-кась
ну-кася
ну-ко
ну-кось
ну-ну
ну-тка
нуте
нуте-ка
нуте-с
ня
ням-ням
О
о
о-го-го
о-ля-ля
о-о
о-хо-хо
о’кей
оба-на
ого
огонь
однако
одначе
ой
ой-йо
ок
окей
окич
оп
опа
опаньки
опачки
опля
осторожно
отставить
оу
ох
охоньки
охохоньки
охохонюшки
охохохоньки
охохошеньки
охти
охуенно
П
пардоньте
пас
пиздец
пиздык
пиль
пли
плие
поди
подожди
покеда
покедова
полундра
постой
превед
прекрасно
привет
приветище
проехали
прозит
проклятие
простите
прочь
прощайте
прысь
псст
пст
пух
пфу
пфуй
пшш
Р
р
раз-два
ржунимагу
С
салам
салют
салям
светыньки
слышь
смерть
смирно
сорри
сорян
спокойно
спс
ссс
стоп
стопэ
супер
сцуко
счастливо
Т
та-дам
тик-так
то-то
толк
топ
точнямба
тпру
тпру-у-у
тра-ля-ля
трали-вали
трах
тррр
тс
тсс
тубо
тьфу
тю
тюк
тяф
У
у
увы
угу
ужо
ужотко
упс
ура
уря
уси-пуси
усь
уть
уф
ух
Ф
фак
фап
фас
фи
физкульт-привет
фить
фу
фу-ты
фу-фу
фуй
фук
фух
фырк
фью
фьють
фюйть
Х
ха
ха-ха
ха-ха-ха
хайль
хана
хап
хах
хаюшки
хвать
хе
хе-хе
хех
хи
хи-хи
хлесть
хлобысть
хлысть
хлясть
хм
хны
хнык
хо-хо
хой
хорэ
хр-р-р
хрусть
хрясть
хрясь
хуяк
хуякс
Ц
ц-ц-ц
цап
цок
цып-цып
цыц
Ч
чао
чёрт его знает
чирик
чих
чотаржу
чу
чур
чух
чш
чш-ш
Ш
ш-ш
ш-ш-ш
ша
шабаш
шит
шлик
шу
шш
Щ
щёлк
щуп
Ы
ых
Э
э
э-ге-ге
э-хе-хе
э-э
э-э-э
эва
эвоэ
эврика
эге
эгей
эй
эх
эхма
эщкере
Я
яволь
ядрёна вошь
якши
`

const text2 = `
а-ля
Б
без
без ведома
безо
безъ
благодаря
близ
близко от
В
в
в виде
в зависимости от
в интересах
в качестве
в лице
в отличие от
в отношении
в пандан
в пользу
в преддверии
в продолжение
в результате
в роли
в связи с
в силу
в случае
в соответствии с
в течение
в целях
в честь
в/на
вблизи
ввиду
вглубь
вдогон
вдоль
вдоль по
взамен
включая
вкруг
вместо
вне
внизу
внутри
внутрь
во
во имя
во славу
вовнутрь
возле
вокруг
вопреки
вослед
впереди
вплоть до
впредь до
вразрез
вроде
вслед
вслед за
вследствие
встречу
выключая
выше
Д
для
для-ради
до
З
за
за вычетом
за исключением
за счёт
за-ради
замест
заместо
И
из
из-за
из-под
из-подо
изнутри
изо
исключая
исходя из
К
к
касаемо
касательно
ко
кончая
кроме
кругом
Л
лицом к лицу с
М
меж
между
мимо
Н
на
на благо
на виду у
на глазах у
на предмет
наверху
навроде
навстречу
над
надо
назад
назади
назло
накануне
наместо
наперекор
наперерез
наперехват
наподобие
наподобье
напротив
наряду с
насупротив
насчёт
начиная с
не без
не считая
невзирая на
недалеко от
независимо от
несмотря
несмотря на
ниже
О
о
об
обо
обок
обочь
около
окрест
окроме
окромя
округ
опосля
опричь
от
от имени
от лица
относительно
ото
П
перед
передо
по
по линии
по мере
по направлению к
по отношению к
по поводу
по причине
по случаю
по сравнению с
по-за
по-над
по-под
поблизости от
повдоль
поверх
под
под видом
под эгидой
подле
подо
подобно
позади
позадь
позднее
помимо
поперёд
поперёк
порядка
посверху
посереди
посередине
посерёдке
посередь
после
посреди
посредине
посредством
пред
предо
преж
прежде
при
при помощи
применительно к
про
промеж
промежду
против
противно
противу
путём
Р
ради
рядом с
С
с
с ведома
с помощью
с прицелом на
с точки зрения
с целью
сбоку
сверх
сверху
свыше
середи
середь
сзади
сквозь
скрозь
следом за
смотря по
снизу
со
согласно
сопротив
спустя
среди
средь
сродни
судя по
супротив
У
у
Ч
через
черезо
чрез
`

const text3 = `
а
а вдобавок
а именно
а также
а то
благодаря тому что
благо
буде
будто
вдобавок
в результате чего
в результате того что
в связи с тем что
в силу того что
в случае если
в то время как
в том случае если
в силу чего
ввиду того что
вопреки тому что
вроде того как
вследствие чего
вследствие того что
да вдобавок
да еще
да (= и)
да (= но)
да и
да и то
дабы
даже
даром что
для того чтобы
же
едва
едва…, как
едва…, лишь
ежели
если
если бы
если не…, то
если…, то
затем чтобы
затем что
зато
зачем
и
и все же
и значит
а именно
и поэтому
и притом
и все-таки
и следовательно
и то
и тогда
и еще
и…, и
ибо
и вдобавок
из-за того что
или
или…, или
кабы
как
Как скоро
как будто
как если бы
как словно
как только
как…, так и
как-то?
когда
когда…, то
коли
к тому же
кроме того
ли…, ли
либо
либо…, либо
лишь
лишь бы
лишь только
между тем как
нежели
не столько…, сколько
не то…, не то
не только не…, но и
не только…, но и
не только…., а и
не только…, но даже
невзирая на то что
независимо от того что
несмотря на то что
ни…, ни
но
однако
особенно
оттого
оттого что
отчего
перед тем как
по мере того как
по причине того что
подобно тому как
пока
покамест
покуда
пока не
после того как
поскольку
потому
потому что
почему
прежде чем
при всем том что
при условии что
притом
причем
пускай
пусть
ради того чтобы
раз
раньше чем
с тем чтобы
с тех пор как
словно
так же…, как
так же…, как и
так как
так как…, то
так что
также
тем более что
тогда как
то есть
то ли…, то ли
то…, то
тоже
только
только бы
только что
только лишь
только чуть
точно
хотя
хотя и…, но
хотя…, но
чем
чем…, тем
что
чтоб
чтобы
`
const text4 = `
а
а вот
а вот и
абы
авось
авось-либо
ага
адьё
аж
ажник
ажно
аиньки
ай да
аминь
ан
аск
аушки
аюшки
Б
б
бишь
будто
буквально
бы
бывает
было
В
ван
ведь
верно
вероятно
вестимо
вишь
во
вон
вообще-то
вот
вот-вот
вроде
вряд
вряд ли
всё
всё ж таки
всё-таки
всего
всего-навсего
всего-то
Г
го
Д
да
да уж
давай
давай-ка
даже
дак
де
-де
действительно
дескать
дискать
добре
добро
довольно
допустим
дык
Е
едва ли
едва ли не
едва ль
если
ещё
ещё бы
Ж
ж
же
железно
З
замётано
здрасти-мордасти
И
и
ибн
или
иль
именно
имхо
ин
инда
индо
ино
исключительно
ить
ишь
К
-ка
кажется
как
как бы
конечно
куда
Л
ладно
ладушки
ли
лих
лишь
лучше
ль
М
мол
Н
на
на-тка
навроде
навряд ли
накось
накося
нани
наоборот
не
не-а
небось
незомь
неравно
неровно
нет
нет-нет
нету
нетути
нетушки
неуж
неужели
неужли
неужто
нехай
нешто
ни
никак
ничего
ничоси
ништо
ништяк
ну
ну-ну
ну-с
О
отколь
откуда
откудова
отож
очевидно
П
пасибо
перепрягать
пж
по-видимому
поди
пожалуй
пожалуйста
пока
полно
полноте
положим
положительно
пон
понимаешь
понятно
походу
похоже
правда
предовольно
простите
просто
просто-напросто
прям
прямо
прямо-таки
пускай
пусть
пущай
Р
ради бога
разве
разумеется
решительно
ровно
С
се
сём
сём-ка
скорее
словно
собственно
спасибо
спасибочки
спасибочко
сяб
сяп
Т
так
так-таки
таки
типа
то-сё
то-то
того
тоже
только
точнее
точняк
тудыть
тыры-пыры
У
угодно
уж
уже
ужели
ужель
ужли
Ф
фигушки
фон
Х
хорошо
хоть
хотя
хрен
хренушки
хуё-моё
хуеньки
хули
хуль
хуля
хуля-перехуля
хучь
хуюшки
Ч
чать
что
что-то
чтоб
чтобы
чтой-то
чуть не
Ш
штоб
шур
Э
эва
эдак
эк
этак
это
Я
якобы
`

const formatWords = (text, type) => {
    return '(' + text
        .split('\n')
        .filter(word =>
            word.length > 0
            && !/[А-Я]/.test(word)
            && (type === 'single' ? word.split(' ').length === 1 : true)
            && (type === 'composite' ? word.split(' ').length > 1 :  true)
        )
        .map(word => '"' + word + '"')
        .join(', ') + ')'
}


console.log(formatWords(text4, 'composite'))
console.log(formatWords(text4, 'single'))